-- 基础信息
local base_info = {
	group_id = 133401017
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 17001, monster_id = 21010101, pos = { x = 3607.272, y = -41.119, z = 4649.896 }, rot = { x = 0.000, y = 178.367, z = 0.000 }, level = 1, drop_tag = "丘丘人", pose_id = 9015 },
	{ config_id = 17002, monster_id = 21010101, pos = { x = 3596.351, y = -41.119, z = 4658.927 }, rot = { x = 0.000, y = 231.507, z = 0.000 }, level = 1, drop_tag = "丘丘人", pose_id = 9015 },
	{ config_id = 17003, monster_id = 21010101, pos = { x = 3609.635, y = -41.119, z = 4662.862 }, rot = { x = 0.000, y = 85.281, z = 0.000 }, level = 1, drop_tag = "丘丘人", pose_id = 9015 },
	{ config_id = 17004, monster_id = 21010101, pos = { x = 3607.272, y = -21.313, z = 4649.896 }, rot = { x = 0.000, y = 178.367, z = 0.000 }, level = 1, drop_tag = "丘丘人", pose_id = 9002 },
	{ config_id = 17005, monster_id = 21010101, pos = { x = 3596.351, y = -21.313, z = 4658.927 }, rot = { x = 0.000, y = 231.507, z = 0.000 }, level = 1, drop_tag = "丘丘人", pose_id = 9002 },
	{ config_id = 17006, monster_id = 21010101, pos = { x = 3609.635, y = -21.313, z = 4662.862 }, rot = { x = 0.000, y = 85.281, z = 0.000 }, level = 1, drop_tag = "丘丘人", pose_id = 9002 },
	{ config_id = 17010, monster_id = 20050501, pos = { x = 3542.459, y = -23.386, z = 4731.707 }, rot = { x = 0.000, y = 178.947, z = 0.000 }, level = 1, drop_tag = "魔法生物", disableWander = true },
	{ config_id = 17011, monster_id = 20050301, pos = { x = 3542.536, y = -13.556, z = 4732.126 }, rot = { x = 0.000, y = 182.344, z = 0.000 }, level = 1, drop_tag = "魔法生物", disableWander = true },
	{ config_id = 17012, monster_id = 20050602, pos = { x = 3537.946, y = -16.388, z = 4653.780 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, drop_tag = "魔法生物", disableWander = true }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 17007, gadget_id = 70710078, pos = { x = 3607.408, y = -31.119, z = 4659.539 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1 },
	{ config_id = 17008, gadget_id = 70710078, pos = { x = 3602.181, y = -31.119, z = 4654.026 }, rot = { x = 0.000, y = 124.811, z = 0.000 }, level = 1 },
	{ config_id = 17009, gadget_id = 70710078, pos = { x = 3598.296, y = -31.119, z = 4661.455 }, rot = { x = 0.000, y = 235.645, z = 0.000 }, level = 1 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 17001, 17002, 17003, 17004, 17005, 17006, 17010, 17011, 17012 },
		gadgets = { 17007, 17008, 17009 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================