-- 基础信息
local base_info = {
	group_id = 133401021
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 21001, monster_id = 28070101, pos = { x = 3303.296, y = 417.825, z = 4628.525 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 21002, monster_id = 28070101, pos = { x = 3302.057, y = 418.784, z = 4634.739 }, rot = { x = 0.000, y = 128.413, z = 0.000 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 21006, monster_id = 28070101, pos = { x = 3240.132, y = 411.141, z = 4596.127 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 21007, monster_id = 28070101, pos = { x = 3235.436, y = 410.748, z = 4598.107 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 21008, monster_id = 28070101, pos = { x = 3234.721, y = 407.042, z = 4550.305 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 21009, monster_id = 28070101, pos = { x = 3232.716, y = 403.987, z = 4521.406 }, rot = { x = 0.000, y = 281.709, z = 0.000 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 21010, monster_id = 28070101, pos = { x = 3157.941, y = 380.280, z = 4442.892 }, rot = { x = 0.000, y = 281.709, z = 0.000 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 21011, monster_id = 28070101, pos = { x = 3158.957, y = 378.830, z = 4445.333 }, rot = { x = 0.000, y = 281.709, z = 0.000 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 21012, monster_id = 28070101, pos = { x = 3133.066, y = 337.829, z = 4442.034 }, rot = { x = 0.000, y = 281.709, z = 0.000 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 21013, monster_id = 28070101, pos = { x = 3129.384, y = 336.769, z = 4440.090 }, rot = { x = 0.000, y = 281.709, z = 0.000 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 21014, monster_id = 28070201, pos = { x = 3040.569, y = 321.935, z = 4371.587 }, rot = { x = 0.000, y = 163.814, z = 0.000 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 21015, monster_id = 28070201, pos = { x = 3039.194, y = 322.076, z = 4369.755 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 21016, monster_id = 28070301, pos = { x = 3059.718, y = 351.339, z = 4296.313 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 21017, monster_id = 28070301, pos = { x = 3056.118, y = 348.149, z = 4300.231 }, rot = { x = 0.000, y = 126.866, z = 0.000 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 21018, monster_id = 28070201, pos = { x = 3053.215, y = 338.630, z = 4400.962 }, rot = { x = 0.000, y = 163.814, z = 0.000 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 21019, monster_id = 28070201, pos = { x = 3054.898, y = 340.887, z = 4410.239 }, rot = { x = 0.000, y = 86.349, z = 0.000 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 21020, monster_id = 28070201, pos = { x = 3041.426, y = 325.319, z = 4295.779 }, rot = { x = 0.000, y = 163.814, z = 0.000 }, level = 1, drop_tag = "魔法生物" },
	{ config_id = 21021, monster_id = 28070201, pos = { x = 3037.545, y = 324.996, z = 4295.245 }, rot = { x = 0.000, y = 86.349, z = 0.000 }, level = 1, drop_tag = "魔法生物" }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 21003, gadget_id = 70500000, pos = { x = 3332.864, y = 428.959, z = 4687.236 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, point_type = 2004 },
	{ config_id = 21004, gadget_id = 70500000, pos = { x = 3339.785, y = 429.945, z = 4688.842 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, point_type = 2004 },
	{ config_id = 21005, gadget_id = 70500000, pos = { x = 3332.867, y = 427.045, z = 4673.737 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, point_type = 2004 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 21001, 21002, 21006, 21007, 21008, 21009, 21010, 21011, 21012, 21013, 21014, 21015, 21016, 21017, 21018, 21019, 21020, 21021 },
		gadgets = { 21003, 21004, 21005 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================