-- 基础信息
local base_info = {
	group_id = 133401024
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 24001, gadget_id = 70210101, pos = { x = 3150.712, y = 336.057, z = 4455.377 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, chest_drop_id = 1000100, drop_count = 1, isOneoff = true, persistent = true },
	{ config_id = 24002, gadget_id = 70210101, pos = { x = 3131.110, y = 335.122, z = 4446.513 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, chest_drop_id = 1000100, drop_count = 1, isOneoff = true, persistent = true },
	{ config_id = 24003, gadget_id = 70210101, pos = { x = 3131.876, y = 336.688, z = 4448.478 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, chest_drop_id = 1000100, drop_count = 1, isOneoff = true, persistent = true },
	{ config_id = 24004, gadget_id = 70500000, pos = { x = 3102.882, y = 338.736, z = 4443.261 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, point_type = 2004 },
	{ config_id = 24005, gadget_id = 70500000, pos = { x = 3099.741, y = 338.747, z = 4438.777 }, rot = { x = 0.000, y = 280.126, z = 0.000 }, level = 1, point_type = 2004 },
	{ config_id = 24006, gadget_id = 70500000, pos = { x = 3092.420, y = 338.747, z = 4438.643 }, rot = { x = 0.000, y = 251.869, z = 0.000 }, level = 1, point_type = 2004 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 24001, 24002, 24003, 24004, 24005, 24006 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================